Revit 2027 API
TextEditorOptions Class
 Provides access to settings that control Revit's Text Editor appearance and functionality.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.TextEditorOptions
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextEditorOptions : IDisposable
Public Class TextEditorOptions
	Implements IDisposable
public ref class TextEditorOptions : IDisposable
type TextEditorOptions =
    class
        interface IDisposable
    end
The TextEditorOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ShowBorder |  Show the border box around the text during editing.
ShowOpaqueBackground |  Show opaque background behind the text during editing.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TextEditorOptions
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTextEditorOptions |  Returns the current Revit instance's TextEditorOptions.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.
Example
public void SetEditorOptions()
{
    TextEditorOptions editorOptions = TextEditorOptions.GetTextEditorOptions();
    editorOptions.ShowBorder = false;
    editorOptions.ShowOpaqueBackground = true;
}
See Also
Reference
Autodesk.Revit.UI Namespace